import csv, datetime, requests, sys, urllib3
import alstuCore, re

data = [["Всего","На направлении","ФИО", "Форма обучения", "Факультет", "Направление", "Документы"]]
name = "usersAlSTU.csv" 
totalPeop = 0 #счетчик людей

#Куски страниц =================================================================
pageStart = "https://pk.altstu.ru/"
pageEnd = [["/abitura/list/32/0217/0001/", "07.03.01 — Архитектура (Арх)","Очная"],
["/abitura/list/70/0341/0001/", "38.03.05 — Бизнес-информатика (БИ)","Очная"],
["/abitura/list/73/0742/0001/", "38.03.04 — Государственное и муниципальное управление (ГМУ)","Очная"],
["/abitura/list/32/0190/0001/", "54.03.01 — Дизайн (Диз)","Очная"],
["/abitura/list/32/0342/0001/", "07.03.03 — Дизайн архитектурной среды (ДАС)","Очная"],
["/abitura/list/72/0206/0001/", "27.03.05 — Инноватика (Ин)","Очная"],
["/abitura/list/70/0151/0001/", "09.03.01 — Информатика и вычислительная техника (ИВТ)","Очная"],
["/abitura/list/70/0192/0001/", "10.03.01 — Информационная безопасность (ИБ)","Очная"],
["/abitura/list/74/0567/0001/", "29.03.05 — Конструирование изделий лёгкой промышленности (КИЛП)","Очная"],
["/abitura/list/72/0137/0001/", "15.03.05 — Конструкторско-технологическое обеспечение машиностроительных производств (КТМ)","Очная"],
["/abitura/list/72/0196/0001/", "22.03.01 — Материаловедение и технологии материалов (МиТМ)","Очная"],
["/abitura/list/72/0197/0001/", "15.03.01 — Машиностроение (МС)","Очная"],
["/abitura/list/73/0583/0001/", "38.03.02 — Менеджмент (М)","Очная"],
["/abitura/list/02/0203/0001/", "23.05.01 — Наземные транспортно-технологические средства (ТТС)","Очная"],
["/abitura/list/70/0204/0001/", "12.03.01 — Приборостроение (ПС)","Очная"],
["/abitura/list/70/0126/0001/", "09.03.03 — Прикладная информатика (ПИЭ)","Очная"],
["/abitura/list/70/0124/0001/", "09.03.04 — Программная инженерия (ПИ)","Очная"],
["/abitura/list/74/0664/0001/", "19.03.03 — Продукты питания животного происхождения (ПЖС)","Очная"],
["/abitura/list/74/0565/0001/", "19.03.02 — Продукты питания из растительного сырья (ПРС)","Очная"],
["/abitura/list/74/0903/0001/", "19.03.02 — Продукты питания из растительного сырья (био) (ПРСбио)","Очная"],
["/abitura/list/03/0218/0001/", "08.03.01 — Строительство (С)","Очная"],
["/abitura/list/03/0392/0001/", "08.05.01 — Строительство уникальных зданий и сооружений (СУЗ)","Очная"],
["/abitura/list/72/0207/0001/", "16.03.01 — Техническая физика (ТФ)","Очная"],
["/abitura/list/74/0198/0001/", "15.03.02 — Технологические машины и оборудование (ТМиО)","Очная"],
["/abitura/list/74/0214/0001/", "19.03.04 — Технология продукции и организация общественного питания (ТОП)","Очная"],
["/abitura/list/02/0563/0001/", "23.03.01 — Технология транспортных процессов (ТТП)","Очная"],
["/abitura/list/74/0722/0001/", "18.03.01 — Химическая технология (ХТ)","Очная"],
["/abitura/list/73/0150/0001/", "38.03.01 — Экономика (Эк)","Очная"],
["/abitura/list/73/0389/0001/", "38.05.01 — Экономическая безопасность (ЭБ)","Очная"],
["/abitura/list/02/0370/0001/", "23.03.03 — Эксплуатация транспортно-технологических машин и комплексов (ЭТМ)","Очная"],
["/abitura/list/07/0195/0001/", "13.03.02 — Электроэнергетика и электротехника (Э)","Очная"],
["/abitura/list/02/0143/0001/", "13.03.03 — Энергетическое машиностроение (ЭМ)","Очная"],
["/abitura/list/74/0210/0001/", "18.03.02 — Энерго- и ресурсосберегающие процессы в химической технологии, нефтехимии и биотехнологии (ЭРПХ)","Очная"],
["/abitura/list/18/0889/0002/", "09.03.03 — Прикладная информатика (веч.) (ПИЭ(в))","Очно-заочная"],
["/abitura/list/18/0891/0002/", "38.03.01 — Экономика (веч.) (Эк(в))","Очно-заочная"],
["/abitura/list/18/0341/0003/", "38.03.05 — Бизнес-информатика (БИ)","Заочная"],
["/abitura/list/18/0742/0003/", "38.03.04 — Государственное и муниципальное управление (ГМУ)","Заочная"],
["/abitura/list/18/0902/0003/", "54.03.01 — Дизайн (заоч.) (Диз(з))","Заочная"],
["/abitura/list/18/0151/0003/", "09.03.01 — Информатика и вычислительная техника (ИВТ)","Заочная"],
["/abitura/list/18/0137/0003/", "15.03.05 — Конструкторско-технологическое обеспечение машиностроительных производств (КТМ)","Заочная"],
["/abitura/list/18/0583/0003/", "38.03.02 — Менеджмент (М)","Заочная"],
["/abitura/list/18/0204/0003/", "12.03.01 — Приборостроение (ПС)","Заочная"],
["/abitura/list/18/0126/0003/", "09.03.03 — Прикладная информатика (ПИЭ)","Заочная"],
["/abitura/list/18/0565/0003/", "19.03.02 — Продукты питания из растительного сырья (ПРС)","Заочная"],
["/abitura/list/18/0886/0003/", "08.03.01 — Строительство (заоч.) (С(з))","Заочная"],
["/abitura/list/18/0214/0003/", "19.03.04 — Технология продукции и организация общественного питания (ТОП)","Заочная"],
["/abitura/list/18/0563/0003/", "23.03.01 — Технология транспортных процессов (ТТП)","Заочная"],
["/abitura/list/18/0665/0003/", "20.03.01 — Техносферная безопасность (ТБ)","Заочная"],
["/abitura/list/18/0150/0003/", "38.03.01 — Экономика (Эк)","Заочная"],
["/abitura/list/18/0370/0003/", "23.03.03 — Эксплуатация транспортно-технологических машин и комплексов (ЭТМ)","Заочная"],
["/abitura/list/18/0195/0003/", "13.03.02 — Электроэнергетика и электротехника (Э)","Заочная"]]


#===============================================================================
#Запуск
now = datetime.datetime.now()
print( "####################################\n    [" + now.strftime(" %d-%m-%Y | %H:%M:%S") + "] \n " + "========== CI.Soup AlSTU v0.4  ==========" + "\n")
#===============================================================================

pc = 1 #счетчик сайтов
#Работа с веб ==================================================================
urllib3.disable_warnings(urllib3.exceptions.InsecureRequestWarning)
for pagePart in pageEnd:
    print(">Напр. "+ str(pc) +"/"+str(pageEnd.__len__()) + " Tx", end='')
    headers = {'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.116', 'cookie': 'PHPSESSID=c48788a2cb797ba5b3110b30800eace6'}
    print("-", end='')
    
    response = requests.get(str(pageStart+pagePart[0]), headers=headers, verify=False)
    #print(pageStart+pagePart[0])
    print("Rx | ", end='')
    #print(str(response.text))
    #sys.exit()
    
    #Обработка сайта
    way = pagePart[1]
    stF = pagePart[2]
    #try:
    for item in alstuCore.work(response, totalPeop, way, stF):
        data.append(item)
        
    totalPeop += int(data[data.__len__()-1][1])
    #except TypeError:
     #   pass
    #sys.exit()  
    #print("Всего: " + str(totalPeop)+" | Нет людей")
        
    #print(str(data))
    pc += 1
#sys.exit()
#===============================================================================

#генерация CSV
print("\nСохранение CSV ")
with open(name, "w", newline="") as file:
        writer = csv.writer(file, delimiter=";") 
        writer.writerows(data)

print("Выполнено.\nCI.Soup AlSTU v0.4\nCathx.tech")